OPad-dev/OPad/firmware/sdkconfig.defaults
# ESP32-S3 Native USB and TinyUSB Configuration
CONFIG_IDF_TARGET="esp32s3"

# Release builds: -O2
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS 1000 Hz tick for microsecond-level timing and 1ms USB polling
CONFIG_FREERTOS_HZ=1000

# TinyUSB Composite Device (HID Keyboard + CDC ACM)
CONFIG_TINYUSB=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_HID_ENABLED=y
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_COUNT=1
# Room for the largest device frame, so frames are queued whole (usb_cdc_write)
CONFIG_TINYUSB_CDC_TX_BUFSIZE=2048
# TINYUSB_EVENT_SUSPENDED reaches usb_event_handler (checkpoints counters)
CONFIG_TINYUSB_SUSPEND_CALLBACK=y

# High stack sizes for tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM Support (Octal PSRAM on ESP32-S3R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL (pad UI). Rendering runs on core 1; see main/ui/ui_port.c
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_OBSERVER=y
CONFIG_LV_USE_GIF=y
# LVGL's own fixed pool: never contends with the heap used on the key/USB core
CONFIG_LV_MEM_SIZE_KILOBYTES=160

# Only the LVGL widgets the layouts use (label, bar, image, observer)
# CONFIG_LV_USE_ANIMIMG is not set
# CONFIG_LV_USE_ARC is not set
# CONFIG_LV_USE_ARCLABEL is not set
# CONFIG_LV_USE_BUTTON is not set
# CONFIG_LV_USE_BUTTONMATRIX is not set
# CONFIG_LV_USE_CALENDAR is not set
# CONFIG_LV_USE_CANVAS is not set
# CONFIG_LV_USE_CHART is not set
# CONFIG_LV_USE_CHECKBOX is not set
# CONFIG_LV_USE_DROPDOWN is not set
# CONFIG_LV_USE_IMAGEBUTTON is not set
# CONFIG_LV_USE_KEYBOARD is not set
# CONFIG_LV_USE_LED is not set
# CONFIG_LV_USE_LINE is not set
# CONFIG_LV_USE_LIST is not set
# CONFIG_LV_USE_MENU is not set
# CONFIG_LV_USE_MSGBOX is not set
# CONFIG_LV_USE_ROLLER is not set
# CONFIG_LV_USE_SCALE is not set
# CONFIG_LV_USE_SLIDER is not set
# CONFIG_LV_USE_SPAN is not set
# CONFIG_LV_USE_SPINBOX is not set
# CONFIG_LV_USE_SPINNER is not set
# CONFIG_LV_USE_SWITCH is not set
# CONFIG_LV_USE_TEXTAREA is not set
# CONFIG_LV_USE_TABLE is not set
# CONFIG_LV_USE_TABVIEW is not set
# CONFIG_LV_USE_TILEVIEW is not set
# CONFIG_LV_USE_WIN is not set
# CONFIG_LV_USE_THEME_DEFAULT is not set
# CONFIG_LV_USE_THEME_SIMPLE is not set
# CONFIG_LV_USE_FLEX is not set
# CONFIG_LV_USE_GRID is not set

# Two 2 MB OTA slots (§U-3a). See firmware/partitions.csv: nvs stays at 0x9000
# at its original size, so lifetime counters and owner_id survive the change.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# An OTA image that never reaches esp_ota_mark_app_valid_cancel_rollback()
# (app_main, once HID is up) is rolled back by the bootloader on the next reset
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set
